# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 1]]  # 1-P2/4
  - [-1, 1, SPD, []]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 1]]  # 4-P3/8
  - [-1, 1, SPD, []]
  - [-1, 6, C2f, [256, True]]   #6
  - [-1, 1, Conv, [512, 3, 1]]  # 7-P4/16
  - [-1, 1, SPD, []]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 1]]  # 10-P5/32
  - [-1, 1, SPD, []]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 13


head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 19 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  
  - [-1, 1, CoordAtt, []]
  - [-1, 3, C2f, [128]]   #22

  - [-1, 1, Conv, [128, 3, 1]]   #23
  - [-1, 1, SPD, []]
  - [[-1, 19], 1, Concat, [1]]  # cat head P4
  - [-1, 1, CoordAtt, []] 
  - [-1, 3, C2f, [256]]  # 26(P4/16-medium)

  - [-1, 1, Conv, [256, 3, 1]] #27
  - [-1, 1, SPD, []]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 1, CoordAtt, []]
  - [-1, 3, C2f, [512]] #30

  - [-1, 1, Conv, [ 512, 3, 1 ] ]
  - [-1, 1, SPD, []]
  - [[ -1, 13 ], 1, Concat, [1] ]
  - [-1, 1, CoordAtt, []]
  - [-1, 3, C2f, [ 1024 ] ] #34

  - [[23, 28, 33, 38], 1,  Detect, [nc]]
